app/views/admin_orders/index.html.erb

SELECT "orders".* FROM "orders"
SELECT  "orders".* FROM "orders" ORDER BY "orders"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
					    <tr>
					      <th scope="row"><%= od.order_id %></th>
					      <td><%= od.order_detail.user.last_name %><%= od.order_detail.user.first_name %></td>