app/views/admin_orders/show.html.erb

							    <td><%= order.item_disk_name %></td>
							    <td><%= order.order_detail.quantity %></td>
							    <td><%= order.item.price*order.order_detail.quantity %>円</td>
---
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 91]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]

		    <li class="list-group-item">配送先<%= @order.shipping_address.address %></li>
		    <li class="list-group-item">支払い方法<%=@order.order_detail.order.payment %></li>
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 85], ["LIMIT", 1]]