app/views/admin_orders/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
		    <li class="list-group-item">orderID <%= @order.id %></li>
		   <% user = User.with_deleted.find(@order.user_id) %>