app/views/users/show.html.erb

            </div>
            <% if @user.order_details.exists? %>
---
SELECT "order_details".* FROM "order_details" WHERE "order_details"."user_id" = ?  [["user_id", 7]]
SELECT  1 AS one FROM "order_details" WHERE "order_details"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]

                    <tbody>
                        <% @user.order_details.each do |od| %>
---
SELECT "order_details".* FROM "order_details" WHERE "order_details"."user_id" = ?  [["user_id", 7]]

                              <td><%= od.item.disk_name %></td>
                              <td><%= od.order.total_price %></td>
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]