app/views/admin_items/edit.html.erb

  <h4>アーティスト</h4>
   <%= f.collection_select :artist_id, Artist.all, :id, :artist_name %>
---
SELECT "artists".* FROM "artists"

  <h4>レーベル</h4>
   <%= f.collection_select :label_id, Label.all, :id, :label_name %>
---
SELECT "labels".* FROM "labels"

  <h4>カテゴリ</h4>
   <%= f.collection_select :category_id, Category.all, :id, :category_name %>
---
SELECT "categories".* FROM "categories"