app/views/admin_items/show.html.erb

      <p class="bg-info text-left">✾収録内容</p>
      <% @item.disks.each do |disk| %>
---
SELECT "disks".* FROM "disks" WHERE "disks"."item_id" = ?  [["item_id", "1"]]


	      <% disk.songs.each do |song| %>
---
SELECT "songs".* FROM "songs" WHERE "songs"."disk_id" = ?  [["disk_id", "1"]]