app/views/orders/new.html.erb

SELECT "shipping_addresses".* FROM "shipping_addresses"
---
	<div>
    	<%= f.collection_select :shipping_address, ShippingAddress.all, :shipping_name, :shipping_name %>