app/views/admin_users/index.html.erb

			        <td><%= customer.user.last_name %></td>
			        <td><%= customer.user.first_name %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]