app/controllers/admin_orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 91], ["LIMIT", 1]]
UPDATE "orders" SET "order_status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["order_status", 1], ["updated_at", "2019-07-25 07:32:47.836348"], ["id", 91]]
---
def update
	order = Order.find(params[:id])
	order.update(order_params)