app/controllers/admin_items_controller.rb

def create
	@item = Item.new(item_params)
	if @item.save!
---
INSERT INTO "items" ("disk_name", "stock", "price", "item_status", "created_at", "updated_at", "artist_id", "label_id", "category_id", "image_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

def artistcreate
	@artist = Artist.new(artist_params)
	@artist.save
---
INSERT INTO "artists" ("artist_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["artist_name", "Ikunaga"], ["created_at", "2019-07-23 04:08:08.737703"], ["updated_at", "2019-07-23 04:08:08.737703"]]

def labelcreate
	@label = Label.new(label_params)
	@label.save
---
INSERT INTO "labels" ("label_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["label_name", "ponaty"], ["created_at", "2019-07-23 04:08:28.163317"], ["updated_at", "2019-07-23 04:08:28.163317"]]

def categorycreate
	@category = Category.new(category_params)
	@category.save
---
INSERT INTO "categories" ("category_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["category_name", "edm"], ["created_at", "2019-07-23 04:08:39.566923"], ["updated_at", "2019-07-23 04:08:39.566923"]]

def update
	item = Item.find(params[:id])
	item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "image_id" = ?, "disk_name" = ?, "stock" = ?, "price" = ?, "disk_id" = ?, "updated_at" = ? WHERE "items"."id" = ?

def destroy
	@item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def index
	    @items = Item.all.page(params[:page]).per(8)
---
SELECT  "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"