app/controllers/admin_users_controller.rb

    def index
	  @customer = User.with_deleted.all.page(params[:page]).per(8)
---
SELECT COUNT(*) FROM "users" WHERE "users"."deleted_at" IS NULL
SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]

    def show
      @user = User.find(params[:id])
      @order = Order.where(user_id: @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 4]]

    def edit
	  @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

    def update
	  user = User.find(params[:id])
	  user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "last_name_kana" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_name_kana", "eeee"], ["updated_at", "2019-07-27 07:19:21.745073"], ["id", 1]]

    def destroy
        user = User.find(params[:id])
        user.destroy
        user.update(email: user.deleted_at.to_i.to_s + '_' + user.email.to_s)
---
SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "deleted_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["deleted_at", "2019-07-24 08:29:43.661156"], ["updated_at", "2019-07-24 08:29:43.661239"], ["id", 1]]