app/controllers/cart_details_controller.rb

	def index
		@cart = CartDetail.all
		@cart = current_user.cart_details
	    @totalprice = 0
	    @cart.each do |cart|
---
SELECT "cart_details".* FROM "cart_details"
SELECT SUM(price) FROM "cart_details"
SELECT "cart_details".* FROM "cart_details" WHERE "cart_details"."user_id" = ?  [["user_id", 4]]

	def create
	    @cart_item = current_user.cart_details.build(cart_detail)
	    @cart_item.save
---
INSERT INTO "cart_details" ("quantity", "created_at", "updated_at", "item_id", "user_id") VALUES (?, ?, ?, ?, ?)  [["quantity", 1], ["created_at", "2019-07-23 10:17:00.560382"], ["updated_at", "2019-07-23 10:17:00.560382"], ["item_id", 2], ["user_id", 4]]

	def update
	    cart = CartDetail.find(params[:id])
	    cart.update(cart_params)
---
SELECT  "cart_details".* FROM "cart_details" WHERE "cart_details"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "cart_details" SET "quantity" = ?, "updated_at" = ? WHERE "cart_details"."id" = ?  [["quantity", 1], ["updated_at", "2019-07-23 05:13:28.475835"], ["id", 3]]

	def destroy
	    cart = CartDetail.find(params[:id])
	    cart.destroy
---
SELECT  "cart_details".* FROM "cart_details" WHERE "cart_details"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "cart_details" WHERE "cart_details"."id" = ?  [["id", 15]]

	def setup_cart_item!
        @cart_item = current_user.items.find(item_id: params[:item_id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]