app/controllers/cart_details_controller.rb

	def show
	  @item = Item.find(id: @cart_item)
	  @cart_item = current_user.items

	  @cart = CartDetail.all
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "cart_details".* FROM "cart_details"
SELECT SUM(price) FROM "cart_details"

	def destroy
	  @cart_item.destroy
---
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 2]]