app/controllers/items_controller.rb

  def search
  	@items = Item.page(params[:page]).per(PER)
---
SELECT  "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]