app/controllers/items_controller.rb

  def index
  	@items =  Item.order("RANDOM()").limit(4)
---
SELECT  "items".* FROM "items" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 4]]

  def search
  	@item = Item.all
---
SELECT "items".* FROM "items"

  def show
  	@item = Item.find(params[:id])
  	@review = Review.new
  	@review.item_id = @item.id
  	@reviews = Review.all
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."item_id" = ?  [["item_id", 2]]