app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def new
		@cart_detail = CartDetail.all
		@cart_detail = current_user.cart_details
		@orders = Order.find(1)

INSERT INTO "orders" ("shipping_address", "payment", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["shipping_address", "qwerty"], ["payment", 1], ["created_at", "2019-07-24 05:01:12.813342"], ["updated_at", "2019-07-24 05:01:12.813342"]]
---
    def commit
	    @order = Order.new(order_params)
	    if @order.save