app/controllers/orders_controller.rb

SELECT "cart_details".* FROM "cart_details" WHERE "cart_details"."user_id" = ?  [["user_id", 5]]
SELECT  1 AS one FROM "cart_details" WHERE "cart_details"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
---
	def new
		@cart_detail = CartDetail.all
		@cart_detail = current_user.cart_details
		if @cart_detail.exists?

INSERT INTO "shipping_addresses" ("shipping_name", "address", "zip_code", "phone_number", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def shipping_address_create
		@shipping_address = ShippingAddress.new(shipping_params)
		@shipping_address.user_id = current_user.id
		@shipping_address.save!

SELECT "cart_details".* FROM "cart_details" WHERE "cart_details"."user_id" = ?  [["user_id", 3]]
---
	def confirm
	    # 入力値のチェック
	    @cart_detail = CartDetail.all
		@cart_detail = current_user.cart_details
	    @order = Order.new(order_params)
		@order.user_id = current_user.id
	    current_user.cart_details.each do |detail|

SELECT "cart_details".* FROM "cart_details" WHERE "cart_details"."user_id" = ?  [["user_id", 3]]
INSERT INTO "orders" ("shipping_address", "payment", "sub_total_price", "total_price", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "cart_details".* FROM "cart_details" WHERE "cart_details"."user_id" = ?  [["user_id", 4]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 95]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
UPDATE "items" SET "stock" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["stock", 46], ["updated_at", "2019-07-25 10:24:26.175470"], ["id", 17]]
DELETE FROM "cart_details" WHERE "cart_details"."id" = ?  [["id", 31]]
---
    def commit
	    @order = Order.new(order_params)
	    @order.sub_total_price = 0
	    @cart_details = CartDetail.all
		@cart_details = current_user.cart_details
		@order.user_id = current_user.id
	    @cart_details.each do |cd|
	    	@order.sub_total_price += cd.quantity * cd.item.price
		end
		@order.total_price = @order.sub_total_price + @order.shipping_fee

	    if @order.save!
		    #itemの在庫を減らす
		    @order.order_details.each do |od|
		    	item = Item.find(od.item_id)
		    	item.stock = item.stock - od.quantity
		    	item.save
		    end
		    #cartの中身を削除
		    @cart_details.destroy_all