app/controllers/users_controller.rb

	def show
		@user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

	def edit
		@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

	def update
		user = User.find(params[:id])
		    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "www@qqq"], ["encrypted_password", "$2a$11$MJO7t6vo.2yDv/BYizwiRuQuoeOsAADyrLaaTX2bwUbaB7qU1rFHO"], ["updated_at", "2019-07-25 10:41:52.757830"], ["id", 3]]