app/views/cart_details/index.html.erb

SELECT "cart_details".* FROM "cart_details" WHERE "cart_details"."user_id" = ?  [["user_id", 2]]
SELECT SUM("cart_details"."quantity") FROM "cart_details" WHERE "cart_details"."user_id" = ?  [["user_id", 3]]
---
        <div class="price_box col-md-4 col-xs-12" style="font-weight: bold; color: black; background: #FFF; border: solid 3px #6091d3; border-radius: 10px; margin-top: 75px; margin-bottom: 50px;">
          <h2 class="p-3 mb-2" style="width: 300px; padding: 20px; float-left;">小計<%= current_user.cart_details.sum(:quantity) %>点</h2>